output/posts/2017-09-06-the-clean-architecture.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>The Clean Architecture | The journal that counts</title>
<link href="../assets/css/bootstrap.min.css" rel="stylesheet" type="text/css">
<link href="../assets/css/html4css1.css" rel="stylesheet" type="text/css">
<link href="../assets/css/nikola_rst.css" rel="stylesheet" type="text/css">
<link href="../assets/css/code.css" rel="stylesheet" type="text/css">
<link href="../assets/css/colorbox.css" rel="stylesheet" type="text/css">
<link href="../assets/css/theme.css" rel="stylesheet" type="text/css">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../rss.xml">
<link rel="canonical" href="https://example.com/posts/2017-09-06-the-clean-architecture.html">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Pieter Swinkels">
<link rel="prev" href="2017-09-06-clean-code-episode-7--architecture--use-cases-and-high-level-design.html" title="Clean Code episode 7: Architecture, Use Cases and High Level Design" type="text/html">
<link rel="next" href="2017-09-19-installing-emacs-25.x-on-ubuntu.html" title="Installing Emacs 25.x on Ubuntu" type="text/html">
<meta property="og:site_name" content="The journal that counts">
<meta property="og:title" content="The Clean Architecture">
<meta property="og:url" content="https://example.com/posts/2017-09-06-the-clean-architecture.html">
<meta property="og:description" content="The Clean Architecture



I googled for the terms Entities, Interactors and Boundaries and that lead me to
the following blog post by Martin from 2012, The Clean Architecture. In this
post he mentions">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2017-09-06T23:49:00+02:00">
<meta property="article:tag" content="architecture">
<meta property="article:tag" content="cleancode">
</head>
<body>
<a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>

<!-- Menubar -->

<nav class="navbar navbar-inverse navbar-static-top"><div class="container">
<!-- This keeps the margins nice -->
        <div class="navbar-header">
            <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#bs-navbar" aria-controls="bs-navbar" aria-expanded="false">
            <span class="sr-only">Toggle navigation</span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            </button>
            <a class="navbar-brand" href="https://example.com/">

                <span id="blog-title">The journal that counts</span>
            </a>
        </div>
<!-- /.navbar-header -->
        <div class="collapse navbar-collapse" id="bs-navbar" aria-expanded="false">
            <ul class="nav navbar-nav">
<li>
<a href="../archive.html">Archive</a>
                </li>
<li>
<a href="../categories/index.html">Tags</a>
                </li>
<li>
<a href="../rss.xml">RSS feed</a>

                
            </li>
</ul>
<ul class="nav navbar-nav navbar-right">
<li>
    <a href="2017-09-06-the-clean-architecture.org" id="sourcelink">Source</a>
    </li>

                
            </ul>
</div>
<!-- /.navbar-collapse -->
    </div>
<!-- /.container -->
</nav><!-- End of Menubar --><div class="container" id="content" role="main">
    <div class="body-content">
        <!--Body content-->
        <div class="row">
            
            
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="#" class="u-url">The Clean Architecture</a></h1>

        <div class="metadata">
            <p class="byline author vcard"><span class="byline-name fn" itemprop="author">
                    <a href="../authors/pieter-swinkels.html">Pieter Swinkels</a>
            </span></p>
            <p class="dateline"><a href="#" rel="bookmark"><time class="published dt-published" datetime="2017-09-06T23:49:00+02:00" itemprop="datePublished" title="2017-09-06 23:49">2017-09-06 23:49</time></a></p>
            
        <p class="sourceline"><a href="2017-09-06-the-clean-architecture.org" class="sourcelink">Source</a></p>

        </div>
        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">The Clean Architecture</h2>
<div class="outline-text-2" id="text-1">

<p>
I googled for the terms Entities, Interactors and Boundaries and that lead me to
the following blog post by Martin from 2012, <a href="https://8thlight.com/blog/uncle-bob/2012/08/13/the-clean-architecture.html">The Clean Architecture</a>. In this
post he mentions several architectures from "the last several years":
</p>
<blockquote>
<p>
Though these architectures all vary somewhat in their details, they are very
similar. They all have the same objective, which is the separation of concerns.
They all achieve this separation by dividing the software into layers.
</p>
</blockquote>
<p>
The article describes the benefits of such an approach and the architectur it
leads to.
</p>

<p>
This separation in layers is very related to guidelines I have tried to
follow for the last decade:
</p>

<ul class="org-ul">
<li>each layer considers the system at one specific level of abstraction;
</li>
<li>each layer builds upon other layers: those lower layers have a level of
abstraction that is equal to the current layer, or lower;
</li>
<li>each layer has a well-defined interface and layers only communicate through
that interface;
</li>
<li>each layer only talks to the layers below it.
</li>
</ul>
<p>
For me, designs that satisfy these requirements almost emerge automatically when
you do Test-Driven Development.
</p>

<p>
Once caveat, the fact that I try to follow these guidelines does not mean I
always succeed…
</p>
</div>
</div>
    </div>
    <aside class="postpromonav"><nav><ul itemprop="keywords" class="tags">
<li><a class="tag p-category" href="../categories/architecture.html" rel="tag">architecture</a></li>
            <li><a class="tag p-category" href="../categories/cleancode.html" rel="tag">cleancode</a></li>
        </ul>
<ul class="pager hidden-print">
<li class="previous">
                <a href="2017-09-06-clean-code-episode-7--architecture--use-cases-and-high-level-design.html" rel="prev" title="Clean Code episode 7: Architecture, Use Cases and High Level Design">Previous post</a>
            </li>
            <li class="next">
                <a href="2017-09-19-installing-emacs-25.x-on-ubuntu.html" rel="next" title="Installing Emacs 25.x on Ubuntu">Next post</a>
            </li>
        </ul></nav></aside></article>
</div>
        <!--End of body content-->

        <footer id="footer">
            Contents © 2017         <a href="mailto:swinkels.pieter@yahoo.com">Pieter Swinkels</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         
            
        </footer>
</div>
</div>


            <script src="../assets/js/jquery.min.js"></script><script src="../assets/js/bootstrap.min.js"></script><script src="../assets/js/moment-with-locales.min.js"></script><script src="../assets/js/fancydates.js"></script><script src="../assets/js/jquery.colorbox-min.js"></script><script>$('a.image-reference:not(.islink) img:not(.islink)').parent().colorbox({rel:"gal",maxWidth:"100%",maxHeight:"100%",scalePhotos:true});</script><!-- fancy dates --><script>
    moment.locale("en");
    fancydates(0, "YYYY-MM-DD HH:mm");
    </script><!-- end fancy dates -->
</body>
</html>
